from collections import Counter

words = ["시즌", "대회", "투어" ,"우승", "스퀘어", "스토어", "상장", "선수" ,"무인", "클라우드",
         "공모", "유해" ,"최종", "골프" ,"채용", "보안" ,"여자", "마지막", "케어", "교육",
         "연속", "안전" ,"뱅크", "로봇" ,"텔레콤", "매장" ,"캡스" ,"해킹" ,"서비스", "일감",

         "기업" , "시장", "사이버", "월더스", "사업", "공격",
         "예측", "철회" ,"금융",  "대표" ,"투자자", "청약," "플랫폼", "대상",
         "매출" ,"글로벌" ,"투자" ,"성장", "랜섬", "증시", "올해" ,"기술", "그룹", "업계",

         "심사", "주주", "예비", "분할", "하이닉스",
         "거래소", "증권", "주식", "코스피", "자금", "쉴더스", "내년", "기업가", "기사",
         "프로", "반도체", "가를", "버스", "자회사", "주가", "회사", "결전", "파트너",

         "솔루션", "영상", "순찰", "기능",
         "감지", "출입", "스마트", "적용", "편의잠",  "협약", "인증", "고객", "관리",
         "모니터링", "시스템", "설치", "카메라", "운영", "지능", "팩토리", "안심",

         "장애인", "사회", "지원", "가상", "활동", "탐지", "가구",
         "알림", "취약", "협력", "소상", "차량", "계층", "실무",
         "생태계", "지역", "양성", "인재", "제로", "예방", "무료", "처리",

         "케이", "비즈", "외국인", "씨티", "청호컴넷", "상승", "씨아이", "택티엔",
         "네트", "필로", "의혹", "스케", "파인", "에스", "원스", "시스", "기관", "매도",
         "에이", "테크", "효성", "했습니다", "일간", "연관", "전일", "살펴보면", "테마",

         "디스", "비스", "나노", "트론", "아이", "맥스", "리퍼블릭",
         "엠투엠", "코콤", "하이", "플러스", "스페이스", "코위버", "에어로", "블록",
         "체인", "에프", "일리", "한화", "매매", "필드", "테라", "홀딩스",

         "출전", "타이틀", "보기",
         "열린", "훈련", "순위", "무대", "전인", "획득", "트로피", "승부", "아마추어",
         "올라", "사상", "후원", "네트웍", "스포츠", "후반", "국가대표", "사랑", "성적",

         "경쟁률", "검찰", "위축", "혐의", "범위", "입성", "증거", "일정", "시기",
         "검색", "응시", "배송", "였던", "보안관", "물량", "미만", "허위", "구속",
         "횡령", "자본시장", "대행", "보였다", "어려움", "유안", "공제조합", "이었던", "특정",

         "주식시장", "제주도", "우크라이나", "인플레이션", "암호", "바람", "기준금리", "물가",
         "연기", "스윙", "연방", "여러분", "방어", "골퍼", "탈취", "악성코드",
         "대다수", "수사", "전쟁", "계단", "하루", "반전", "파이오링크", "받지", "한파",

         "서재", "밀리", "금고", "알뜰폰", "금제", "아이즈", "유플러스", "휴가", "실행",
         "가입자", "지니", "요금", "도매", "기부", "사업자", "이통", "통신", "침입", "패스",
         "뮤직", "정랙", "출시", "슬림", "데이터",

         "학과", "스미싱", "피싱", "가온", "백신", "텔레캅", "본사", "서구", "조사",
         "공정위", "해커", "몰아", "절도", "대원", "수법", "줬다는", "문자", "배분",
         "금전", "프로세스", "파일", "재직", "기승", "시설", "품질", "광역시",

         "노조", "자문", "몰아주기", "법률", "공정거래법", "노사", "임금",
         "보장", "모씨", "해양", "교섭", "의결권", "노동조합", "구인", "대우조선", "가중", "불법",
         "기자회견", "신정", "무시", "연대", "결성", "영진", "열사", "노총", "인상", "거래",

         "변가", "관사", "몸값", "웨이브", "토종", "쿠팡", "포기",
         "유동성", "적정", "대기", "몰라주기", "어려울", "리지", "부율", "아마존",
         "넷플릭스", "입점", "우선주", "오픈마켓", "대명", "무산", "유동", "금융감독원", "출격",

         "문구점", "자의", "전형", "오스", "직무", "우대",
         "경력", "기능올림픽",  "일자리", "고용노동부", "신입", "공채", "학력",
         "출근", "합격자", "오피스", "성별", "면접", "신입사원", "러닝", "알고리즘",

         "발인", "별세", "보건", "장례식", "병원", "오전", "부친상", "호실", "모친상", "장인상",
         "남편", "춘천", "탈락", "서울", "과장", "프롭", "부상", "안양", "세브란스병원",
         "신촌", "동아", "회선", "본선", "오후", "원주", "미보", "창모", "강원도",

         "칩스", "유니", "닉스", "텔레", "퀘스트",
         "라이언스", "어플", "콘덴서", "유비", "인포", "룩스", "삼보",
         "픽셀", "팅크", "록스", "삼화", "켐트", "하나마이크론", "모터", "모르",

         "캡스홈", "양사", "택배", "배달", "현관문", "도난", "추석", "연휴", "방범",
         "가드", "출동", "렌탈", "명절", "비밀번호", "도어", "사건", "빈집", "모드",
         "국전", "신변", "기간", "발생", "인파", "우유", "여행", "창문",

         "개발자", "수료",
         "범죄예방", "출입문", "범죄자", "표적", "실전", "주의", "나타났다", "전체", "멘토링", "외출",
         "점검", "분석", "수칙", "연구소", "각별", "건수", "자격", "귀중", "복구", "워드",

         "랜섬웨어", "등급", "이데일리", "성범죄", "교육과정", "여성", "엠게임", "안티",
         "동향", "인턴", "다날", "경찰서", "보고서", "주연테크", "중기",
         "김호준", "언스", "사자", "합동", "파워텔", "타이밍", "잡립",

         "삼다수", "마스터", "상무", "승진", "사무소", "부사", "지켰다", "인사", "노컷뉴스",
         "스티커", "국방부", "전무", "발굴", "브랜드", "준수", "원칙", "임원",
         "부문", "정신", "세트", "의원", "홍보", "에스원", "리더십", "노컷", "달라진",

         "계정", "문서", "서버", "난방", "중소기업", "재택근무",
         "매니저", "중앙", "커뮤니케이션", "린지", "근무", "캠페인", "방지",
         "메시지", "체험", "저장", "서나", "어디", "직원", "이메일", "공략",

         "스팩", "하단", "피해자", "반출", "엑스", "수술실", "세아",
         "스케이", "넷째", "의료", "자이크", "추적", "변조",  "보호",
         "의료법", "결재", "타임스", "소액",

         "셀프", "이마트", "점포", "편의점", "결제", "프렌들리", "안면", "무게",
         "개통", "할인", "등록", "논스톱", "제휴", "통제", "헬로비전", "추척", "세븐일레븐",
         "뉴스", "선반", "이뤄진다", "보급", "과금", "모션", "휴대폰", "입장", "결합",

         "표창", "서울특별시", "투표", "에어컨", "청장", "봉사활동", "수해", "지진", "유공", "포항",
         "재건축", "발열", "포항시", "경북", "화상", "제일모직", "대우건설", "총장", "트럭", "의심",
         "도움", "고문", "착용", "과학", "강원", "여름", "동아일보", "모임", "주택", "의회",

         "흑자", "핀더", "멘털", "이익", "영업", "분기", "재계약",
         "현대", "모비스", "동기", "기록", "적자", "한섬", "고려아연", "유한양행", "제출",
         "감소", "코스피지수", "증가", "자공시", "석유화학", "순이익", "잠정", "집계",

         "모주", "시초", "초가", "열기", "승계", "성적표", "단위", "간사",
         "돌입", "증권사", "후보자", "알려졌습니다", "거듭",
         "경제", "합병", "생방송", "신고", "리츠", "납부", "우량", "재태크", "집결",

         "친환경", "달력", "적십자사", "환경보호", "헌혈", "제작", "동참", "부금",
         "구입", "성경제", "성금", "공헌", "푸른", "이웃", "이윤차", "부회장",
         "만든", "적십자", "라이온", "머니투데이", "약속",

         "어린이집", "시니어", "키즈", "하원", "박진", "부모", "전화", "보호자", "유치원",
         "오프", "새해", "출결", "냉장고", "해태", "크라운", "원아", "보낼",
         "카드", "자녀", "인포섹", "브로드밴드", "보육", "미세먼지", "디지털타임스", "겸임", "무제",

         "온실가스", "탄소", "연료", "감축", "충전", "배출량", "전기차", "재생에너지", "일진", "배출",
         "듀얼", "증인", "스코프", "피엔", "조선", "공항",
         "녹색","국민일보", "해럴드경제", "포스코", "스맥",

         "스터디", "경기장", "시나리오", "플레이", "티비", "선수단", "창원", "리서치", "미성년", "파크",
         "신원", "관람", "펜싱", "쓰래기", "과중", "즐길", "음원",
         "알려", "신용카드", "기물", "프로야구", "터널", "촬영", "린다", "다이노스"]

# 전체 단어의 개수
print(f"주어진 단어 목록의 총 개수: {len(words)}")

# 단어의 빈도수를 세고, 1회 이상 나타난 단어들을 찾기
word_counts = Counter(words)
duplicates_with_counts = {word: count for word, count in word_counts.items() if count > 1}

# 중복된 단어가 없으면 메시지 출력
if not duplicates_with_counts:
    print("일치 없음")
else:
    print(duplicates_with_counts)
