# 라이브러리 설치 확인
# pip install pandas yfinance
# python keyword_analysis.py
# !pip install yfinance pandas

import pandas as pd

# 데이터 로드 (경로 확인 필요)
data = pd.read_csv('news.csv')  # 로컬 파일 경로로 수정
data['date'] = pd.to_datetime(data['date'])  # 날짜 형식 변환

# 제공된 키워드 리스트
keywords = [
        # 불용어 448
        "클라우드",
        "매출","추진","글로벌",
        "성장","공개","케어","대표","캡스",

        "웨어","위협","안전",
        "플랫폼","데이터",
        "랭킹","하반기",
        # 토픽감소
        "상금","보안","스토어","서비스","무인","솔루션","박민지","기록",
        "금융","고객","포인트","사이버","챔피언십","공격","로봇","플랫폼","사업","기술",
        "카카오","프로","매장","영상","선두","메타","대응","시드","랜섬",

        "공모","철회","투자","투자자","청약","뱅크","심사","시장","주주","기업",
        "예비","가치","증권","자금","증시","분할","주식","흥행","평가","기업가",
        "거래소","주가","컬리","쉴더스","회사","희망","자회사","거래","은퇴","배당",
        
        "에스원","SK 쉴더스","KT텔레캅","아이디스","코로나"
        "인증", "백신패스","백신", "QR","코드"
]

# 지정된 기간 설정
start_date = '2019-01-01'
end_date = '2023-10-24'
filtered_data = data[(data['date'] >= start_date) & (data['date'] <= end_date)]

# 결과를 저장할 빈 DataFrame 생성 및 초기화
date_range = pd.date_range(start=start_date, end=end_date)
result_df = pd.DataFrame(index=date_range, columns=keywords + ['기사 합산'])
result_df = result_df.fillna(0)  # 모든 값을 0으로 초기화

# 각 날짜와 키워드 조합에 대해 포함된 기사의 개수를 확인
for date in date_range:
    daily_data = filtered_data[filtered_data['date'] == date]
    for keyword in keywords:
        count = daily_data['title'].str.contains(keyword, case=False, na=False).sum()
        result_df.at[date, keyword] = count
    result_df.at[date, '기사 합산'] = result_df.loc[date, keywords].sum()

# 결과 출력
print(result_df)
result_df

'''
1차 130개 단어
keywords = [
        # 불용어 448
        "투자","공모","기업","보안","쉴더스","시장","사이버","뱅크","클라우드","사업",
        "매출","투자자","증권","회사","추진","청약","평가","가치","심사","글로벌",
        "기록","프로","성장","공개","자회사","케어","대표","지난해","공동","캡스",

        "보안","서비스","공격","증시","공모","랜섬","웨어","위협","안전","솔루션",
        "로봇","희망","흥행","플랫폼","선두","데이터","상황","영상","고객","쉴더스",
        "시장","포인트","랭킹","기술","하반기","금융","하면","대응","은퇴","합계",
        # 토픽감소
        "상금","보안","스토어","서비스","무인","기업","시장","솔루션","박민지","기록",
        "금융","고객","포인트","사이버","챔피언십","공격","로봇","프랫폼","사업","기술",
        "카카오","프로","매장","영상","선두","메타","증권","대응","시드","랜섬",

        "공모","철회","투자","투자자","청약","뱅크","심사","시장","주주","기업",
        "예비","가치","증권","자금","증시","분할","주식","흥행","평가","기업가",
        "거래소","주가","컬리","쉴더스","회사","희망","자회사","거래","은퇴","배당",
        
        "에스원","SK 쉴더스","KT텔레캅","아이디스","코로나","인증", "백신패스","백신", "QR","코드"
'''